{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "[]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "[]": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "0": 14,
      "1": 15,
      "2": 16,
      "3": 17,
      "4": 18,
      "5": 19,
      "6": 20,
      "7": 21,
      "8": 22,
      "9": 23,
      "=": 24,
      "?": 25,
      "_": 26,
      "a": 27,
      "c": 28,
      "d": 29,
      "e": 30,
      "f": 31,
      "i": 32,
      "l": 33,
      "m": 34,
      "n": 35,
      "o": 36,
      "p": 37,
      "r": 38,
      "s": 39,
      "t": 40,
      "u": 41,
      "v": 42,
      "w": 43,
      "x": 44,
      "y": 45,
      "##/": 46,
      "##d": 47,
      "##i": 48,
      "##v": 49,
      "##(": 50,
      "##-": 51,
      "##x": 52,
      "##_": 53,
      "##r": 54,
      "##e": 55,
      "##f": 56,
      "##n": 57,
      "##s": 58,
      "##w": 59,
      "##a": 60,
      "##p": 61,
      "##o": 62,
      "##u": 63,
      "##c": 64,
      "##m": 65,
      "##l": 66,
      "##t": 67,
      "##y": 68,
      "##)": 69,
      "*x": 70,
      "##_(": 71,
      "*x_(": 72,
      "/n": 73,
      "?/": 74,
      "##_r": 75,
      "##ow": 76,
      "##_row": 77,
      "/n-": 78,
      "))": 79,
      ",/": 80,
      "##di": 81,
      "##v(": 82,
      ",/di": 83,
      ",/div(": 84,
      "##s(": 85,
      "##_rows(": 86,
      "##re": 87,
      "##du": 88,
      "##e_rows(": 89,
      "##ce_rows(": 90,
      "?/re": 91,
      "##duce_rows(": 92,
      "?/reduce_rows(": 93,
      ",/div(-": 94,
      "##ip": 95,
      "##ul": 96,
      "##mul": 97,
      "##ly": 98,
      "##tip": 99
    }
  }
}