{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK], []",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK], []": 4,
      "(": 5,
      ")": 6,
      "*": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "?": 24,
      "_": 25,
      "a": 26,
      "c": 27,
      "d": 28,
      "e": 29,
      "f": 30,
      "i": 31,
      "l": 32,
      "m": 33,
      "n": 34,
      "o": 35,
      "p": 36,
      "r": 37,
      "s": 38,
      "t": 39,
      "u": 40,
      "v": 41,
      "w": 42,
      "x": 43,
      "y": 44,
      "##/": 45,
      "##m": 46,
      "##u": 47,
      "##l": 48,
      "##t": 49,
      "##i": 50,
      "##p": 51,
      "##y": 52,
      "##_": 53,
      "##r": 54,
      "##o": 55,
      "##w": 56,
      "##(": 57,
      "##e": 58,
      "##d": 59,
      "##c": 60,
      "##s": 61,
      "##-": 62,
      "##n": 63,
      "##v": 64,
      "##f": 65,
      "##x": 66,
      "##a": 67,
      "##)": 68,
      "*x": 69,
      "##_(": 70,
      "*x_(": 71,
      "/n": 72,
      "?/": 73,
      "##_r": 74,
      "##ow": 75,
      "##_row": 76,
      "))": 77,
      ",/": 78,
      "##iv": 79,
      "##div": 80,
      ",/div": 81,
      ",/div(": 82,
      "/n-": 83,
      "##s(": 84,
      "##_rows(": 85,
      "##re": 86,
      "##uc": 87,
      "##e_rows(": 88,
      "##duc": 89,
      "?/re": 90,
      "##duce_rows(": 91,
      "?/reduce_rows(": 92,
      ",/div(-": 93,
      "##mu": 94,
      "##lt": 95,
      "##ly": 96,
      "##ip": 97,
      "?/mu": 98,
      "##_row(": 99
    }
  }
}