{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK], []",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK], []": 4,
      "(": 5,
      ")": 6,
      "*": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "_": 24,
      "a": 25,
      "c": 26,
      "d": 27,
      "e": 28,
      "i": 29,
      "l": 30,
      "m": 31,
      "o": 32,
      "p": 33,
      "r": 34,
      "s": 35,
      "t": 36,
      "u": 37,
      "v": 38,
      "w": 39,
      "x": 40,
      "y": 41,
      "##/": 42,
      "##d": 43,
      "##i": 44,
      "##v": 45,
      "##(": 46,
      "##-": 47,
      "##r": 48,
      "##e": 49,
      "##u": 50,
      "##c": 51,
      "##_": 52,
      "##o": 53,
      "##w": 54,
      "##s": 55,
      "##)": 56,
      "##m": 57,
      "##l": 58,
      "##t": 59,
      "##p": 60,
      "##y": 61,
      "##x": 62,
      "##a": 63,
      "*x": 64,
      "##_(": 65,
      "*x_(": 66,
      "##ro": 67,
      "##_ro": 68,
      "##_row": 69,
      "))": 70,
      ",/": 71,
      "##di": 72,
      "##v(": 73,
      ",/di": 74,
      ",/div(": 75,
      "##s(": 76,
      "##_rows(": 77,
      "/r": 78,
      "##du": 79,
      "##e_rows(": 80,
      "##edu": 81,
      "##ce_rows(": 82,
      "/redu": 83,
      "/reduce_rows(": 84,
      ",/div(-": 85,
      "/m": 86,
      "##ip": 87,
      "##ul": 88,
      "##ly": 89,
      "##tip": 90,
      "##_row(": 91,
      "/mul": 92,
      "##ly_row(": 93,
      "##tiply_row(": 94,
      "/multiply_row(": 95,
      "/s": 96,
      "##wa": 97,
      "##p_rows(": 98,
      "/swa": 99,
      "/swap_rows(": 100,
      ",-": 101,
      "e-": 102
    }
  }
}