{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK], []",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "WhitespaceSplit"
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          1
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          2
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK], []": 4,
      "(": 5,
      ")": 6,
      "*": 7,
      "+": 8,
      ",": 9,
      "-": 10,
      ".": 11,
      "/": 12,
      "0": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "6": 19,
      "7": 20,
      "8": 21,
      "9": 22,
      "=": 23,
      "_": 24,
      "a": 25,
      "c": 26,
      "d": 27,
      "e": 28,
      "i": 29,
      "l": 30,
      "m": 31,
      "n": 32,
      "o": 33,
      "p": 34,
      "r": 35,
      "s": 36,
      "t": 37,
      "u": 38,
      "v": 39,
      "w": 40,
      "x": 41,
      "y": 42,
      "##/": 43,
      "##d": 44,
      "##i": 45,
      "##v": 46,
      "##(": 47,
      "##-": 48,
      "##n": 49,
      "##r": 50,
      "##e": 51,
      "##u": 52,
      "##c": 53,
      "##_": 54,
      "##o": 55,
      "##w": 56,
      "##s": 57,
      "##a": 58,
      "##p": 59,
      "##)": 60,
      "##m": 61,
      "##l": 62,
      "##t": 63,
      "##y": 64,
      "##x": 65,
      "*x": 66,
      "##_(": 67,
      "*x_(": 68,
      "/n": 69,
      "##ro": 70,
      "##_ro": 71,
      "/n/": 72,
      "##_row": 73,
      "/n-": 74,
      "))": 75,
      ",/": 76,
      "##di": 77,
      "##v(": 78,
      ",/di": 79,
      ",/div(": 80,
      "##s(": 81,
      "##_rows(": 82,
      "##du": 83,
      "##re": 84,
      "##e_rows(": 85,
      "##ce_rows(": 86,
      "/n/re": 87,
      "##duce_rows(": 88,
      "/n/reduce_rows(": 89,
      ",/div(-": 90,
      "##ip": 91,
      "##ul": 92,
      "##mul": 93,
      "##ly": 94,
      "##tip": 95,
      "/n/mul": 96,
      "##_row(": 97,
      "##ly_row(": 98,
      "##tiply_row(": 99
    }
  }
}